tests/load_test/scaled_test/150_users/reports/statistics.json
{
  "getAllInfo" : {
    "transaction" : "getAllInfo",
    "sampleCount" : 3000,
    "errorCount" : 124,
    "errorPct" : 4.133333,
    "meanResTime" : 6194.317000000002,
    "medianResTime" : 2019.0,
    "minResTime" : 0.0,
    "maxResTime" : 318224.0,
    "pct1ResTime" : 15094.7,
    "pct2ResTime" : 23797.299999999996,
    "pct3ResTime" : 50127.32999999994,
    "throughput" : 2.899800300419311,
    "receivedKBytesPerSec" : 16.559274689564294,
    "sentKBytesPerSec" : 0.3854997540002745
  },
  "getAllStatus" : {
    "transaction" : "getAllStatus",
    "sampleCount" : 3000,
    "errorCount" : 114,
    "errorPct" : 3.8,
    "meanResTime" : 9842.805333333321,
    "medianResTime" : 3387.0,
    "minResTime" : 0.0,
    "maxResTime" : 335204.0,
    "pct1ResTime" : 20891.100000000006,
    "pct2ResTime" : 28657.199999999983,
    "pct3ResTime" : 78755.59999999998,
    "throughput" : 2.897954334035604,
    "receivedKBytesPerSec" : 8.110694029574107,
    "sentKBytesPerSec" : 0.5092824571489153
  },
  "postNewRequest" : {
    "transaction" : "postNewRequest",
    "sampleCount" : 3000,
    "errorCount" : 105,
    "errorPct" : 3.5,
    "meanResTime" : 12923.402999999998,
    "medianResTime" : 3682.5,
    "minResTime" : 0.0,
    "maxResTime" : 347715.0,
    "pct1ResTime" : 24245.500000000004,
    "pct2ResTime" : 35510.74999999996,
    "pct3ResTime" : 302624.9799999998,
    "throughput" : 2.8979179425555386,
    "receivedKBytesPerSec" : 4.298839584605197,
    "sentKBytesPerSec" : 0.9602183182705998
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 12000,
    "errorCount" : 527,
    "errorPct" : 4.391667,
    "meanResTime" : 11904.265666666677,
    "medianResTime" : 3876.5,
    "minResTime" : 0.0,
    "maxResTime" : 382404.0,
    "pct1ResTime" : 24584.399999999998,
    "pct2ResTime" : 35419.849999999955,
    "pct3ResTime" : 275843.36999999965,
    "throughput" : 11.558433177326593,
    "receivedKBytesPerSec" : 7383.950343466066,
    "sentKBytesPerSec" : 2.5443988690675137
  },
  "getDataOfRequestID" : {
    "transaction" : "getDataOfRequestID",
    "sampleCount" : 3000,
    "errorCount" : 184,
    "errorPct" : 6.133333,
    "meanResTime" : 18656.537333333345,
    "medianResTime" : 7982.0,
    "minResTime" : 0.0,
    "maxResTime" : 382404.0,
    "pct1ResTime" : 35698.6,
    "pct2ResTime" : 49703.099999999904,
    "pct3ResTime" : 322970.08999999997,
    "throughput" : 2.8898393249335337,
    "receivedKBytesPerSec" : 7355.6634764420905,
    "sentKBytesPerSec" : 0.6950289345162409
  }
}