tests/load_test/unscaled_test/75_user/report/statistics.json
{
  "getAllInfo" : {
    "transaction" : "getAllInfo",
    "sampleCount" : 1500,
    "errorCount" : 1019,
    "errorPct" : 67.933334,
    "meanResTime" : 1022.0133333333316,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 16174.0,
    "pct1ResTime" : 5488.5,
    "pct2ResTime" : 7080.9,
    "pct3ResTime" : 8920.62,
    "throughput" : 8.59081927779846,
    "receivedKBytesPerSec" : 31.492578784971794,
    "sentKBytesPerSec" : 0.382011808796999
  },
  "getAllStatus" : {
    "transaction" : "getAllStatus",
    "sampleCount" : 1500,
    "errorCount" : 1044,
    "errorPct" : 69.6,
    "meanResTime" : 1715.0066666666642,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 15763.0,
    "pct1ResTime" : 6619.700000000001,
    "pct2ResTime" : 8354.550000000001,
    "pct3ResTime" : 12596.99,
    "throughput" : 8.59367391017892,
    "receivedKBytesPerSec" : 23.10546304326342,
    "sentKBytesPerSec" : 0.47708317816977663
  },
  "postNewRequest" : {
    "transaction" : "postNewRequest",
    "sampleCount" : 1500,
    "errorCount" : 1027,
    "errorPct" : 68.46667,
    "meanResTime" : 2155.143999999999,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 16530.0,
    "pct1ResTime" : 8402.9,
    "pct2ResTime" : 11517.2,
    "pct3ResTime" : 13426.6,
    "throughput" : 8.590474881451447,
    "receivedKBytesPerSec" : 19.366856498264724,
    "sentKBytesPerSec" : 0.9285263094031339
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 6000,
    "errorCount" : 4176,
    "errorPct" : 69.6,
    "meanResTime" : 1963.0071666666631,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 34738.0,
    "pct1ResTime" : 7506.400000000003,
    "pct2ResTime" : 10197.699999999995,
    "pct3ResTime" : 18542.529999999926,
    "throughput" : 34.18978751047062,
    "receivedKBytesPerSec" : 5997.155981734818,
    "sentKBytesPerSec" : 2.382072166450131
  },
  "getDataOfRequestID" : {
    "transaction" : "getDataOfRequestID",
    "sampleCount" : 1500,
    "errorCount" : 1086,
    "errorPct" : 72.4,
    "meanResTime" : 2959.8646666666655,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 34738.0,
    "pct1ResTime" : 10643.400000000001,
    "pct2ResTime" : 16101.900000000001,
    "pct3ResTime" : 26092.98000000001,
    "throughput" : 8.551930170639514,
    "receivedKBytesPerSec" : 5926.678395356801,
    "sentKBytesPerSec" : 0.6039132563469575
  }
}